УТ/src/InformationRegisters/CRM_ОбъектыАРМ_Поддержка/CRM_ОбъектыАРМ_Поддержка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ОбъектыАРМ_Поддержка</name>
  <resources>
    <name>Соисполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>СостояниеИнтереса</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОтбора</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Обращение</name>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/Catalogs/CRM_ТипыОбращений/CRM_ТипыОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ТипыОбращений</name>
  <predefined>
    <items>
      <name>Интерес</name>
      <description>Интерес</description>
    </items>
    <items>
      <name>Обращение</name>
      <description>Обращение</description>
    </items>
  </predefined>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/InformationRegisters/CRM_ОбъектыАРМ_Поддержка/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ПереходНаНовуюВерсию

Процедура ЗаполнитьДанныеПриПереходеНаВерсию(Параметры) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 5000
	                      |	CRM_Интерес.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.CRM_Интерес КАК CRM_Интерес
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ОбъектыАРМ_Поддержка КАК CRM_ОбъектыАРМ_Поддержка
	                      |		ПО (CRM_ОбъектыАРМ_Поддержка.Обращение = CRM_Интерес.Ссылка)
	                      |ГДЕ
	                      |	CRM_Интерес.ЭтоПоддержка
	                      |	И CRM_ОбъектыАРМ_Поддержка.Обращение ЕСТЬ NULL
	                      |	И НЕ CRM_Интерес.ПометкаУдаления
	                      | И CRM_Интерес.ТипОбращения <> ЗНАЧЕНИЕ(Справочник.CRM_ТипыОбращений.Интерес)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	CRM_Интерес.Дата УБЫВ");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		CRM_РаботаАРМСервер.CRM_ЗаполнениеАРМПоддержка(Выборка.Ссылка, Ложь);
		ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка); 
	КонецЦикла;
	
	Выборка.Сбросить();
	
	Если Выборка.Следующий() Тогда
		ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка); 
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = (Выборка.Количество() < 5000);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#КонецЕсли
